/*
> Приведите пример иерархии классов (словесное описание), где применяется принцип Открыт-Закрыт, и обоснуйте, почему одни классы (модули) выбраны открытыми, а другие закрытыми.

Пример иерархии c наследованием:

    OrderDeliveryManager реализует важную логику в методе Process, которая была протестирована и критична для бизнеса, поэтому ее нельзя изменять. 
    В этом методе вызывается метод доступный для переопределения.
    
    class OrderDeliveryManager
    {
        public void Process()
        {
            // логика обработки заказа
        }

        protected virtual void AfterProcessHook()
        {
            // do something
        }
    }

    HolidayOrderDeliveryManager наследует у OrderDeliveryManager и переопределяет дополнительную метод открытый для изменений.

    class HolidayOrderDeliveryManager : OrderDeliveryManager
    {
        protected override void AfterProcessHook()
        {
            // Новая логика:
            // Например отправить поздравительное сообщение после обработки заказа.
        }
    }
    
    Таким образом базовый класс остается закрытым, критическая логика остается неизменной, а октрытость достигается за счет изменений в открытом методе в классе-наследнике.

    При необходимости можно создать другого наследника OrderDeliveryManager, который реализует другую логику.
*/
