/*
> Как в C# поддерживается концепция "класс как модуль"?
Пока мы говорим именно про "классы" в смысле модули -- пространство имен, сборки, пакеты, библиотеки --все что содержит готовый код и что можно импортировать в свою программу.

В С# возможности "упаковки" кода представлены следующей иерархией:

- Пакеты Nuget
- Сборки (Assembly)
- Неймспейсы (Namespaces)
- Классы

В свою очередь статические классы дают возможность использовать код без создания обьектов класса. 
Также есть возможность расширения класса и деления класса на несколько с помощью частичных классов.
*/
